<a href="https://colab.research.google.com/github/KTIHAM/Data-Science-Prcatice-Sessions/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np

In [ ]:
r = np.arange(36)
r.resize((6, 6))
r

array([[ 0,  1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10, 11],
       [12, 13, 14, 15, 16, 17],
       [18, 19, 20, 21, 22, 23],
       [24, 25, 26, 27, 28, 29],
       [30, 31, 32, 33, 34, 35]])

In [ ]:
import pandas as pd
pd.Series?

In [ ]:
animals = ['Tiger', 'Bear', 'Moose']
pd.Series(animals)

0    Tiger
1     Bear
2    Moose
dtype: object

In [ ]:
numbers = [1, 2, 3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [ ]:
friends = ['Tiham', 'Sadakat', None]
pd.Series(friends)

0      Tiham
1    Sadakat
2       None
dtype: object

In [ ]:
Numbers = [65, 345, None]
pd.Series(Numbers)

0     65.0
1    345.0
2      NaN
dtype: float64

In [ ]:
import numpy as np
np.nan == None

False

In [ ]:
np.nan == np.nan

False

In [ ]:
np.isnan(np.nan)

True

In [ ]:
sports = {'Cricket' : 'Bangladesh', 'BasketBall' : 'USA', 'Football' : 'Canada'} 
s = pd.Series(sports)
s

Cricket       Bangladesh
BasketBall           USA
Football          Canada
dtype: object

In [ ]:
s.index
s.loc['Cricket']

'Bangladesh'

In [ ]:
s = pd.Series(['Tiger', 'Bear', 'Moose'], index = ['India', 'America', 'Canada'])

In [ ]:
s.iloc[2]

'Moose'

In [ ]:
Events = {'Song' : 'Tiham', 
          'Dance' : 'Whores',
          'Drama' : 'Queen',
          'Poetry' : None}

e = pd.Series(Events)

In [ ]:
e.iloc[2]

'Queen'

In [ ]:
e.loc['Song']

'Tiham'

In [ ]:
e[2]

'Queen'

In [ ]:
e['Song']

'Tiham'

In [ ]:
sports = {99 : 'Bhutan',
          100: 'India', 
          101: 'Bangladesh', 
          102: 'Arabia'}
s = pd.Series(sports)
s

99         Bhutan
100         India
101    Bangladesh
102        Arabia
dtype: object

In [ ]:
s = pd.Series([100.00, 100.00, 100.00, 100.98], index = [10, 20, 30, 40])
s

10    100.00
20    100.00
30    100.00
40    100.98
dtype: float64

In [ ]:
total = 0
for item in s:
  total += item
print(total)

400.98

In [ ]:
import numpy as np

total = np.sum(s)
print(total)

400.98

In [ ]:
s = pd.Series(np.random.randint(0, 1000, 10000))
s.head()

0    191
1    290
2    150
3    359
4     47
dtype: int64

In [ ]:
len(s)

10000

In [ ]:
%%timeit -n 100
summary = 0
for item in s:
  summary += item

100 loops, best of 3: 1.3 ms per loop

In [ ]:
%%timeit -n 100
summary = np.sum(s)

100 loops, best of 3: 129 µs per loop

In [ ]:
s += 2
s.head()

0    193
1    292
2    152
3    361
4     49
dtype: int64

In [ ]:
%%timeit -n 10
s = pd.Series(np.random.randint(0, 1000, 10000))
for label, value in s.iteritems():
      s.loc[label] = value+2

10 loops, best of 3: 641 ms per loop

In [ ]:
%%timeit -n 10
s = pd.Series(np.random.randint(0, 1000, 10000))
s += 2

10 loops, best of 3: 432 µs per loop

In [ ]:
s = pd.Series([1, 2, 3])
s.loc['Smart'] = 'Tiham'
s

0            1
1            2
2            3
Smart    Tiham
dtype: object

In [ ]:
original_sports = pd.Series({"Archery":'Bhutan', 
                             'Golf':'Scotland',
                             'Sumo':'Japan',
                             'Taekwondo':'South Korea'})
cricket_loving_countries = pd.Series(['Australia', 'Sri-Lanka', 'Pakistan', 'England'], 
                                     index = ['Cricket', 'Cricket', 'Cricket', 'Cricket'])

all_countries = original_sports.append(cricket_loving_countries)

In [ ]:
original_sports
all_countries

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
Cricket        Australia
Cricket        Sri-Lanka
Cricket         Pakistan
Cricket          England
dtype: object

In [ ]:
import pandas as pd

In [ ]:
purchase_1 = pd.Series({'Name':'Tiham', 'item':'Book', 'cost': 55894.235})
purchase_2 = pd.Series({'Name':'Foara', 'item':'Cosmetics', 'cost': 59.00})
purchase_3 = pd.Series({'Name':'Sadakat', 'item':'Laptop', 'cost': 85000.00})

df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Shop - 1', 'Shop - 1', 'Shop - 3'])
df.head()

             Name       item       cost
Shop - 1    Tiham       Book  55894.235
Shop - 1    Foara  Cosmetics     59.000
Shop - 3  Sadakat     Laptop  85000.000

In [ ]:
df['item']

Shop - 1         Book
Shop - 1    Cosmetics
Shop - 3       Laptop
Name: item, dtype: object

In [ ]:
df.loc['Shop - 1', 'cost']

Shop - 1    55894.235
Shop - 1       59.000
Name: cost, dtype: float64

In [ ]:
df.T

     Shop - 1   Shop - 1 Shop - 3
Name    Tiham      Foara  Sadakat
item     Book  Cosmetics   Laptop
cost  55894.2         59    85000

In [ ]:
df.T.loc['cost']

Shop - 1    55894.2
Shop - 1         59
Shop - 3      85000
Name: cost, dtype: object

In [ ]:
new_cost = df['cost']
new_cost

Shop - 1    55894.235
Shop - 1       59.000
Shop - 3    85000.000
Name: cost, dtype: float64

In [ ]:
new_cost += 2
new_cost

Shop - 1    55896.235
Shop - 1       61.000
Shop - 3    85002.000
Name: cost, dtype: float64

In [ ]:
df

             Name       item       cost
Shop - 1    Tiham       Book  55896.235
Shop - 1    Foara  Cosmetics     61.000
Shop - 3  Sadakat     Laptop  85002.000

In [ ]:
df.loc['Shop - 1']['cost']

Shop - 1    55896.235
Shop - 1       61.000
Name: cost, dtype: float64

In [ ]:
df.loc[:, ['item', 'cost']]

               item       cost
Shop - 1       Book  55896.235
Shop - 1  Cosmetics     61.000
Shop - 3     Laptop  85002.000

In [ ]:
df.drop('Shop - 3')

           Name       item       cost
Shop - 1  Tiham       Book  55896.235
Shop - 1  Foara  Cosmetics     61.000

In [ ]:
df

             Name       item       cost
Shop - 1    Tiham       Book  55896.235
Shop - 1    Foara  Cosmetics     61.000
Shop - 3  Sadakat     Laptop  85002.000

In [ ]:
copy_df = df.copy()
copy_df = copy_df.drop('Shop - 1')
copy_df

             Name    item     cost
Shop - 3  Sadakat  Laptop  85002.0

In [ ]:
copy_df['Name'] = 0
copy_df

          Name    item     cost
Shop - 3     0  Laptop  85002.0

In [ ]:
del copy_df["Name"]
copy_df

            item     cost
Shop - 3  Laptop  85002.0